[
    {
    "id": "637003b090ebf5fd7f3df9d9",
    "project": "636ff5764b1addc12334323e",
    "title": "North Beacon Hill P-Patch",
    "date_created": "2022-10-29T21:05:00.716Z",
    "brief_content": [
        "The Seattle Department of Neighborhoods’ (DON) P-Patch Community Gardening Program will raise plot fees for the 2023-2024 biennium. Seattle Municipal Code Section 3.35.060 authorizes the Director of the Department of Neighborhoods to adjust base P-Patch plot fees every two years in response to 1) inflation approximately in proportion to the change in the Consumer Price Index (CPI) All Urban Consumers, and 2) program operational cost increases of up to 5%. Plot fees include an application fee and a permit fee. For 2023-2024, the application fee will rise from $34.00 to $36.00 and the permit fee for 100 square feet of gardening space will increase from $16.00 to $17.00.  The 2023-2024 increase is based solely on a cumulative CPI increase of 6.64% for the two most recent years for which data is available (2020-2021). With inflation rates reaching 40-year highs in 2022 and impacting the economic health of thousands of Seattle households, DON has elected to not apply an operational cost adjustment for the 2023-2024 biennium.  The P-Patch Program also remains committed to providing plot fee assistance to all gardeners in need."
        ],
    "image_url": "https://fastly.4sqi.net/img/general/width960/uBegDhvgMYid_AHhnF-9mmPL7lexTekwREMgto1X6wo.jpg"
    },
    {
    "id": "637004a28898262927751e25",
    "project": "636ff5764b1addc12334323e",
    "title": "Dr. Jose Rizal Park Squash Courts",
    "date_created": "2022-10-29T21:05:00.716Z",
    "brief_content": [
        "Squash is a racket and ball sport played by two or four players in a four-walled court with a mall, hollow, rubber ball. The players alternate in striking the ball with their rackets onto the playable surfaces of the four walls of the court. The objective of the game is to hit the ball in such a way that the opponent is not able to play a valid return. There are about 20 million people who play squash regularly world-wide in over 185 countries.[1] The governing body of Squash, the World Squash Federation (WSF), is recognized by the International Olympic Committee (IOC), but the sport is not part of the Olympic Games, despite a number of applications. Supporters continue to lobby for its incorporation in a future Olympic program. The Professional Squash Association (PSA) organizes the pro tour. The sport is infrequently called squash rackets, to distinguish itself from the related sport of rackets (also called hard rackets, prison tennis)."
        ],
    "image_url": "http://seattlebloggers.com/wp-content/uploads/2013/08/Rizal-Park-1.jpg"
    },
    {
    "id": "637004caa61b821305eb3c0d",
    "project": "636ff5764b1addc12334323e",
    "title": "More Open Space at Dr. Jose Rizal Park",
    "date_created": "2022-10-29T21:05:00.716Z",
    "brief_content": [
        "A landscape is the visible features of an area of land, its landforms, and how they integrate with natural or man-made features, often considered in terms of their aesthetic appeal.[1] A landscape includes the physical elements of geophysically defined landforms such as (ice-capped) mountains, hills, water bodies such as rivers, lakes, ponds and the sea, living elements of land cover including indigenous vegetation, human elements including different forms of land use, buildings, and structures, and transitory elements such as lighting and weather conditions. Combining both their physical origins and the cultural overlay of human presence, often created over millennia, landscapes reflect a living synthesis of people and place that is vital to local and national identity. \n The character of a landscape helps define the self-image of the people who inhabit it and a sense of place that differentiates one region from other regions. It is the dynamic backdrop to people's lives. Landscape can be as varied as farmland, a landscape park or wilderness. The Earth has a vast range of landscapes, including the icy landscapes of polar regions, mountainous landscapes, vast arid desert landscapes, islands, and coastal landscapes, densely forested or wooded landscapes including past boreal forests and tropical rainforests, and agricultural landscapes of temperate and tropical regions. The activity of modifying the visible features of an area of land is referred to as landscaping."
        ],
    "image_url": "https://www.seattle.gov/images//images/Departments/ParksAndRecreation/Parks/DEF/JoseRizalPark2.jpg"
    }
]