[
    {
    "id": "63573373b7503ffea3be2a8f",
    "title": "Dr. Jose Rizal Park Renovation",
    "intro": "Nestled between Chinatown/International District and Beacon Hill neighborhoods, Dr. Jose Rizal Park serves a diversity of communities with its panoramic views of downtown Seattle. There are steep hill gradients on the 4-acre site, which have naturally divided it into upper and lower levels. The upper level of the park, bordered by 12th Ave. on the east side and a chain link fence on the west side at the top of slope, is the focus of this design opportunity. The upper level of the park includes a covered picnic structure, restroom building, stepped amphitheater seating, a junior playground, lawn areas and plantings, and is home to a bronze bust of Dr. Jose Rizal, a national hero of the Philippines, sculpted by the late Filipino master sculptor, Anastacio Caedo and East is West, a triptych mosaic mural designed by Filipino artist Val Laigo, commissioned by the Filipino American Community. \n While Seattle Parks & Recreation (SPR) has owned the land since the 1970s, the park was renovated, officially dedicated to and named after Dr. Jose Rizal in the 1980s. The local Filipino community raised funds to develop the park which remains a culturally significant gathering place for Seattle Filipinos. Elevate will harness the potential of this park with due respect for the history and culturally significant elements and functions of the space, as an important component of the community and of the Seattle public realm in general.",
    "budget_description": "Seattle Park District Fund: $50,000, Real Estate Excise Tax II Capital Fund: $350,000, Seattle Parks and Recreation is working to secure additional funding and grants for this project.",
    "project_description": "Park improvements including renovation and/or reconfiguration of existing park assets.",
    "submission_deadline": "2022-10-29T21:05:00.716Z",
    "project_reqs": [
        "Adequate space to hold various events and gatherings are highly desirable.",
        "Maintain the existing parking count.",
        "Keep the triptych mosaic mural in its existing location.",
        "The playground, bronze bust and plaques of Dr. Jose Rizal must remain on site but may be rearranged or moved within the park site as desired.",
        "Restroom building should not be relocated, but the interior can be renovated and reconfigured.",
        "Other existing park functions and elements may be kept, and new functions and elements may be suggested. However, the implementation of selected ideas will be subject to funding being available."
    ],
    "brief_reqs": [
        "Introduction: Your background and interest in this project, in a written narrative of maximum two hundred (200) words.",
        "Project Summary: Description of project purpose and design vision, in a written narrative of maximum five hundred (500) words.",
        "Design Statement: Describe how your approach will develop a place that respects the history of the neighborhood and serves their community. Examples or possible mediums are: drawing(s), sketch(es), video(s), photo(s), artwork, etc. (Not all the mediums listed are required, nor are the mediums limited to these). We encourage creativity in your responses."
    ],
    "image_urls": ["https://i.ibb.co/d5p7yG7/mikosticker.png", "https://i.ibb.co/d5p7yG7/mikosticker.png"],
    "briefs": [
        "63573373b7503ffea3be2a8f",
        "63573373b7503ffea3be2a8f",
        "63573373b7503ffea3be2a8f"
    ]
    }
]